Revit 2026 API
ViewDisplayDepthCueing Class
 Represents the settings for depth cueing.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ViewDisplayDepthCueing
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ViewDisplayDepthCueing : IDisposable
Public Class ViewDisplayDepthCueing
	Implements IDisposable
public ref class ViewDisplayDepthCueing : IDisposable
type ViewDisplayDepthCueing =
    class
        interface IDisposable
    end
The ViewDisplayDepthCueing type exposes the following members.
Properties
Name | Description
EnableDepthCueing |  True to enable depth cueing. False to disable it.
EndPercentage |  The end percentage defines where depth cueing ends. Values between 0 and 100.
FadeTo |  The fade to defines the maximum fading in per cent. Values between 0 and 100.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
StartPercentage |  The start percentage defines where depth cueing starts. Values between 0 and 100.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ViewDisplayDepthCueing
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetStartEndPercentages |  Sets start and end percentages.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace